Revit 2027 API
BeamSystem.LayoutRule Property
Retrieves or changes the LayoutRule of the BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LayoutRule LayoutRule { get; set; }
Public Property LayoutRule As LayoutRule
	Get
	Set
public:
property LayoutRule^ LayoutRule {
	LayoutRule^ get ();
	void set (LayoutRule^ value);
}
member LayoutRule : LayoutRule with get, set
Property Value
LayoutRule
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace